import '../../domain/author.dart';

class  Authors {

  static final authors = [

  Author(
    "Рамис Ганиев",
    "https://hi-news.ru/author/thehalo",
    "https://secure.gravatar.com/avatar/bde89841b02b04e6bcfff759d7fa03c7?s=120&#038;d=mm&#038;r=r",
    "1 684 материала  для Hi-News.ru",
    "2 года и 3 месяца в редакции",
    "Автор новостей Hi-News.ru с 2018 года. В прошлом — дизайнер, бывший сотрудник «Типичного программиста», автор статей для интернет-магазинов и блогов. С самого детства любитель документальных фильмов и передач Discovery Channel и National Geographic. Обожаю писать про археологические раскопки и случаи из медицинской практики. Не представляю жизни без подкастов.\n\n2012 - 2013 — автор текстов для интернет-магазинов и новостей для небольших сайтов и блогов про технологии;\n\n2013 - 2015 — проходил курсы компьютерного дизайна, участвовал в развитии студии переводов и озвучивания «Антоновка», текстовик крупного онлайн-кинотеатра с уклоном на обучение английского языка (сейчас закрыт);\n\n2015 - 2018 — автор статей в нескольких Telegram-каналах и сообществах про науку и технологии, новостник в «Типичном программисте»;\n\n2018 — автор новостей на Androidinsider.ru, Appleinsider.ru и Hi-news.ru. Со временем полностью перебрался на Hi-News."
  ),
  Author(
    "Hi-News.ru",
    "https://hi-news.ru/author/hi-news-ru",
    "https://secure.gravatar.com/avatar/e644cf3afe7888df2d0000a1940a87e0?s=120&#038;d=mm&#038;r=r",
    "974 материала  для Hi-News.ru",
    "8 лет в редакции",
    "Под именем Hi-News.ru мы публикуем редакционные материалы, которые не отражают мнение конкретного автора сайта, но является \"коллективной\" статьей от имени редакции.\n\nЧаще всего от имени Hi-News.ru выходят статьи с объявлениями о работе сайта, открытыми вакансиями или рекламными материалами (помечаются меткой \"Промо\")"
  ),
  Author(
    "Любовь Соковикова",
    "https://hi-news.ru/author/liubov",
    "https://secure.gravatar.com/avatar/a4e0d7ad54061c031d14b5260e77a196?s=120&#038;d=mm&#038;r=r",
    "816 материалов  для Hi-News.ru",
    "1 год и 4 месяца в редакции",
    "Автор статей на Hi-News.ru с 2019 года. Любит науку и все что с ней связано, несколько лет переводит научно-популярные статьи и видео. Ведет научно-популярный блог crithin, участник программы \"Эпоха просвещения\" livejournal. Выступает в защиту научного знания и здравого смысла, любит научную фантастику, игры про зомби и сериал “Ходячие мертвецы”. С детства мечтает быть похожей на агента Скалли из “Секретных материалов”.\n\n2013-2016 – ассистент-переводчик в крупной международной компании. В обязанности входил последовательный перевод во время переговоров и конференций, а также письменный перевод деловой документации и корпоративных документов.\n\nВ 2014 году закончила Институт иностранных языков (ИИЯ) в Санкт-Петербурге по специальности переводчик с английского и испанского языков.\n\n2017-2019 – старший специалист международного отдела СПБУТУиЭ. Занималась академическим обменом студентов и преподавателей, организацией международных мероприятий, последовательным переводом научных конференций и письменным переводом научных статей в области экономики."
  ),
  Author(
    "Александр Богданов",
    "https://hi-news.ru/author/bogdanov",
    "https://secure.gravatar.com/avatar/01645862927ec151a2d2ebb3d6e7fab3?s=120&#038;d=mm&#038;r=r",
    "275 материалов  для Hi-News.ru",
    "7 лет и 7 месяцев в редакции",
    "Финансист и аналитик в необъятной бездне высоких технологий. Начал интересоваться наукой и всем, что с ней связано, еще тогда, когда Илон Маск занимался созданием PayPal и только мечтал о запуске своей первой ракеты.\n\nИмеет образование факультета управления и экономики высоких технологий НИЯУ МИФИ, поэтому специализируется в основном на экономических материалах, но также обожает автомобили, самолеты и любую технику, способную удивить. Ведущий автомобильной колонки на Hi-News.ru.\n\nНачал работать с редакцией с 2012 года , и в 2014 году вступил в должность директора по развитию Медиагруппы i10.ru. При этом занимается написанием статей и для других проектов Медиагруппы - AppleInsider.ru и AndroidInsider.ru.\n\nВ свободное время любит много читать и считает, что закон Ампера не менее важен, чем все три закона Ньютона. Очень любит космическую тематику и все, что связано с человеческим организмом."
  ),
  Author(
    "Артем Сутягин",
    "https://hi-news.ru/author/legenda_roka",
    "https://secure.gravatar.com/avatar/4ae49d87fd95bb522ee0653a5065b0b4?s=120&#038;d=mm&#038;r=r",
    "199 материалов  для Hi-News.ru",
    "3 года и 11 месяцев в редакции",
    "Знаете ли вы человека, который одновременно является мотоциклистом, ярым фанатом рока, безудержным путешественником, боксером в прошлом, игроком в Call of Duty, но при этом любит классическую прозу, котиков и хорошие мелодрамы? А еще, чтобы этот человек не представлял жизни без ответов на вопросы ”Как?” и ”Почему?”. Иногда нам кажется, что он один такой.\n\nПорой даже родные не знают, где он. Возможно, все из-за безудержной любви к небу и незнакомым городам, в которых всегда приятно повстречаться с новыми людьми. Зато из таких поездок он всегда привозит интересные темы для статей и изливает их в научно-популярной форме на страницах Hi-News.ru. Особое внимание старается уделять климату, физическим явлениям, авиации и автомобилям. Видели бы вы, как он завелся, когда писал про Porsche Taycan и дошел до темы автоспорта. Или когда главный редактор говорил ему, что не надо писать статью про крылатые ракеты как книгу.\n\nВ 2009 закончил МГУл по специальности ”Бухгалтерский учет, анализ и аудит”. С этого же года начал работать по специальности в Московском филиале ОАО ”Первая Грузовая Компания”.\n\nВ 2011 участвовал в крупном проекте по оптимизации процесса ремонта вагонов, который завершился успехом. За это был отмечен благодарностью руководства.\n\nВ 2014 перешел в центральный аппарат той же компании на должность финансового аналитика и в течение последующих двух лет работал над крупными проектами, являясь авторам методик, которые применяются в деятельности компании до сих пор.\n\nВ 2016 решил, что творить экономические чудеса ему надоело, и написал письмо генеральному директору медиагруппы i10.ru. Через несколько дней они встретились и договорились о приеме на работу."
  ),
  Author(
    "Ренат Гришин",
    "https://hi-news.ru/author/iprizrak",
    "https://secure.gravatar.com/avatar/bcbb9cf996527b7afaf6792931ba00d6?s=120&#038;d=mm&#038;r=r",
    "29 материалов  для Hi-News.ru",
    "7 лет и 9 месяцев в редакции",
    "Главный редактор Hi-News.ru\n\nУвлекается популярной наукой с ранних лет. В детстве любил читать про то, как устроена наша вселенная. Имеет тягу к техническим знаниям и всему неизвестному. Любит электро-автомобили, природу, походы и рыбалку. Счастлив в браке, имеет сына.\n\n1998 - 2002 Образование высшее, техническое (МИРЭА). Факультет кибернетики по специальности прикладная математика.\n\n2008 - 2010 директор по мобильным проектам в крупной компании, разрабатывающей мобильные приложения для газет и банков.\n\nС 2010 года главный редактор сайта Hi-News.ru.\n\nС 2016  является генеральным директором Медиагруппы i10.ru (ООО Ай10.ру), в которую входит Hi-News.ru, а так же такие популярные издания как AppleInsider.ru, AndroidInsider.ru, 2bitcoins.ru.\n\nС 2018 года сайт является постоянным участником ТОП-20 самых цитируемых IT сайтов по версии \"Медиалогии\"."
  ),
  Author(
    "Николай Хижняк",
    "https://hi-news.ru/author/dekkard",
    "https://secure.gravatar.com/avatar/a3d216a32fa1f541fd2386004385d3df?s=120&#038;d=mm&#038;r=r",
    "8 587 материалов , 2010—2019",
    "",
    "Компьютерный энтузиаст, поклонник технологий и гаджетов, люблю космос, люблю научную фантастику, компьютерные игры и фильмы. Считаю, если я не узнал ничего нового, то день прожит зря."
  ),
  Author(
    "Ауслендер Дмитрий",
    "https://hi-news.ru/author/youtheme",
    "https://secure.gravatar.com/avatar/5215de6ee968ba02d33b1964b9f6a6ef?s=120&#038;d=mm&#038;r=r",
    "5 999 материалов , 2010—2016",
    "",
    "Железный человек."
  ),
  Author(
    "Илья Хель",
    "https://hi-news.ru/author/helle",
    "https://secure.gravatar.com/avatar/743d5db9b194595c743fee06914ecc3e?s=120&#038;d=mm&#038;r=r",
    "3 918 материалов , 2012—2019",
    "",
    ""
  ),
  Author(
    "Алексей Лихачев",
    "https://hi-news.ru/author/shok",
    "https://secure.gravatar.com/avatar/9bbeab6595df6608e5ff58c86bcbdf08?s=120&#038;d=mm&#038;r=r",
    "2 869 материалов , 2007—2013",
    "",
    ""
  ),
  Author(
    "Сергей Грэй",
    "https://hi-news.ru/author/gray",
    "https://secure.gravatar.com/avatar/7b5876d535d04ec85975d437e66f5878?s=120&#038;d=mm&#038;r=r",
    "2 295 материалов , 2013—2018",
    "",
    "Смотрите мои обзоры на видеоигры здесь: https://www.youtube.com/c/drinkplaylove"
  ),
  Author(
    "Владимир Кузнецов",
    "https://hi-news.ru/author/zellcer",
    "https://secure.gravatar.com/avatar/0a97c779d498938284314144aa7eadf8?s=120&#038;d=mm&#038;r=r",
    "1 690 материалов , 2016—2019",
    "",
    "Автор новостей Hi-news.ru. и Androidinsider.ru\n\nОбразование высшее медицинское. Сколько себя помню интересовался наукой и высокими технологиями. Это и привело меня в ряды редакции этого портала."
  ),
  Author(
    "Артем Батогов",
    "https://hi-news.ru/author/artem",
    "https://secure.gravatar.com/avatar/68122abbb3105e001cd6b368481e178e?s=120&#038;d=mm&#038;r=r",
    "665 материалов , 2013—2015",
    "",
    ""
  ),
  Author(
    "Олег Довбня",
    "https://hi-news.ru/author/macfrog",
    "https://secure.gravatar.com/avatar/85cb0afa3a6eeeb1b22f3f65aeb2792d?s=120&#038;d=mm&#038;r=r",
    "586 материалов , 2012—2019",
    "",
    "Историк и программист. Соискатель ученой степени кандидата исторических наук.\n\nТехнологии сыграли в истории человечества огромную роль. Можно даже сказать, что цивилизация во многом определяется именно тем, какими техническими средствами она располагает. От этого зависит очень многое, в том числе и человеческая психология.\n\nСвоими статьями стараюсь напомнить себе и читателю о том славном пути, который проделали высокие технологии за весьма короткое время. О том, что оперативная память и скорость процессора не всегда измерялась в миллиардах. Об этом очень важно помнить, чтобы радоваться тому что есть. И еще... это просто интересно."
  ),
  Author(
    "Дарья Елецкая",
    "https://hi-news.ru/author/dariaeletskaya",
    "https://secure.gravatar.com/avatar/2dbf03a2bc77f95bbf4a79c8122ae45f?s=120&#038;d=mm&#038;r=r",
    "489 материалов , 2019—2020",
    "",
    "Автор Hi-News c 2019 года. Закончила Университет Дружбы Народов в 2015 году по специальностям \"Архитектура и градостроительство\" и \"Немецкий язык в сфере технического перевода\". Имею опыт работы в образовательных учреждениях и СМИ. В настоящее время являюсь действующим сценаристом медиа-компании TheSoul Publishing."
  ),
  Author(
    "Павел Дмитриев",
    "https://hi-news.ru/author/cleg",
    "https://secure.gravatar.com/avatar/d9267845ddd2822f7f0bde3d62a23cdf?s=120&#038;d=mm&#038;r=r",
    "369 материалов , 2013—2019",
    "",
    "Образование — инженер-системотехник.\n\nЛюбитель длинных и многословных обзоров про специфичные железки, хотя иногда не против написать и про другие вещи.\n\nНе любит человеческую глупость во всех проявлениях и старается с ней бороться, невзирая на превосходство противоположной стороны в силах. На гордящихся невежеством смотрит удивленно-осуждающе.\n\nРод занятий — программист на Python и иногда Objective-C, писатель социальных CRM и всяких не менее полезных программ.\n\nХобби — музыка, программирование, новости науки и техники.\n\n1999-2005. Образование — высшее, специальность \"Информационные управляющие системы и технологии\" (НУК)\n\n2005-2008. Работал программистом в Украинском \"Приватбанке\"\n\nС 2008 года разработчик в компании Postindustria, участник многих успешных проектов как back-end (Python) так и front-end (Objective-C, Swift)\n\nС 2020 года автор вебинаров в ГО \"Code Upgrade\", по data science, математической статистике и deep learning"
  ),
  Author(
    "Андрей Барабаш",
    "https://hi-news.ru/author/andybarabash",
    "https://secure.gravatar.com/avatar/0731e971d3beba59538adee063b7a3b5?s=120&#038;d=mm&#038;r=r",
    "348 материалов , 2015—2016",
    "",
    ""
  ),
  Author(
    "Эрнест Василевский",
    "https://hi-news.ru/author/evvasilevskiy",
    "https://secure.gravatar.com/avatar/f27b45b05ad8325c1db36a0e42842c92?s=120&#038;d=mm&#038;r=r",
    "161 материал , 2018",
    "",
    ""
  ),
  Author(
    "Алекс Кудрин",
    "https://hi-news.ru/author/lex_kudrin",
    "https://secure.gravatar.com/avatar/b7fb60ead4796b3ea050751537955360?s=120&#038;d=mm&#038;r=r",
    "92 материала , 2016",
    "",
    "One thing I can tell you is you got to be free"
  ),
  Author(
    "Илья Ильин",
    "https://hi-news.ru/author/digitalmonstro",
    "https://secure.gravatar.com/avatar/0c6aba8b14735701d39d8383dbe7479d?s=120&#038;d=mm&#038;r=r",
    "72 материала , 2014—2016",
    "",
    ""
  ),
  Author(
    "Королев Михаил",
    "https://hi-news.ru/author/admin",
    "https://secure.gravatar.com/avatar/b70d4df047a9560f60017ba50c2bdace?s=120&#038;d=mm&#038;r=r",
    "62 материала , 2006—2020",
    "",
    "Основатель сайта Hi-News.ru, AppleInsider.ru, AndroidInsider.ru, 2bitcoins.ru. Живет в Испании, ведет собственный блог в Инстаграм о жизни в этой солнечной стране.\n\nВ 1998 году окончил Художественно-профессиональный Лицей по профессии ювелир.\n\nВ 1999 году поступил в Институт Культуры и Искуства в городе Санкт Петербург.\n\nВ 2003 открыл сервисный центр и интернет-магазин по продаже сотовых телефонов в Санкт-Петербурге.\n\nВ 2006 году основал Hi-News.ru. Именно в 2006 начали появляться первые статьи на сайте, которые Михаил писал вместе со своей женой.\n\В 2010 создал AppleInsider.ru, а несколькими годами позже совместно с Гришиным Ренатом (главный редактор сайта) учредили компанию i10.ru, которая объединила все проекты вместе.\n\nСчастлив в браке, имеет сына."),
  Author(
    "Александр Балалин",
    "https://hi-news.ru/author/a_balalin",
    "https://secure.gravatar.com/avatar/81056bfa2d6b58e83192ef7d4473fd87?s=120&#038;d=mm&#038;r=r",
    "61 материал , 2016—2019",
    "",
    ""
  ),
  Author(
    "Стас Чегринец",
    "https://hi-news.ru/author/chiga",
    "https://secure.gravatar.com/avatar/ff28be6f2e4974d415fa0c8a0a9c6ad7?s=120&#038;d=mm&#038;r=r",
    "38 материалов , 2013—2016",
    "",
    ""
  ),
  Author(
    "Артём Горячев",
    "https://hi-news.ru/author/goryachev-artem",
    "https://secure.gravatar.com/avatar/bedb51d035a35fac7a702ca0696eeef9?s=120&#038;d=mm&#038;r=r",
    "19 материалов , 2020",
    "",
    ""
  ),
  Author(
    "Ольга Власова",
    "https://hi-news.ru/author/olevelayam",
    "https://secure.gravatar.com/avatar/3311662c4e5b2fda09607959a22369f5?s=120&#038;d=mm&#038;r=r",
    "14 материалов , 2016",
    "",
    ""
  ),
  Author(
    "Олег Кусов",
    "https://hi-news.ru/author/olekus",
    "https://secure.gravatar.com/avatar/7d7062c810c998521a5d070fdf5817a1?s=120&#038;d=mm&#038;r=r",
    "10 материалов , 2020",
    "",
    ""
  ),
  Author(
    "Werwulf",
    "https://hi-news.ru/author/werwulf",
    "https://secure.gravatar.com/avatar/3643ec793736e33f6904de829f7c1811?s=120&#038;d=mm&#038;r=r",
    "2 материала , 2012—2013",
    "",
    ""
  ),
  Author(
    "Мочалов Михаил",
    "https://hi-news.ru/author/zero_shadows",
    "https://secure.gravatar.com/avatar/c22e12e3eb5ef5f7db8473ef09e11d17?s=120&#038;d=mm&#038;r=r",
    "2 материала , 2013",
    "",
    ""
  ),
  Author(
    "Александр Данилин",
    "https://hi-news.ru/author/alex_nilinad",
    "https://secure.gravatar.com/avatar/08c2aebb5e78eaa2d1d5c4ed1d83f1f1?s=120&#038;d=mm&#038;r=r",
    "2 материала , 2015—2016",
    "",
    ""
  ),

  ];

}