import 'package:flutter/material.dart';

import '../../domain/my_theme.dart';

class Themes {

  static const COUNT_MAIN_THEMES = 13;

  static List<NewsTheme> getMainThemes() {
    return themes.take(COUNT_MAIN_THEMES).toList();
  }

  static List<NewsTheme> getThemesByIds(List<String> themeIds) {
    final List<NewsTheme> newThemes = [];
    themes.forEach((theme) {
      if (themeIds.contains(theme.id)) {
        newThemes.add(theme);
      }
    });
    return newThemes;
  }

  static NewsTheme getThemeById(String themeId) {
    return themes.firstWhere((theme) => theme.id == themeId);
  }

  static final themes = [
    NewsTheme(
        "zagadki-kosmosa",
        "Загадки космоса",
        "mystery_of_space.webp",
        "Космос это чертовски большая штука, которая может быть бесконечной или циклической. Ученые до сих пор этого не знают, но постоянно выдвигают разные теории, о которых мы и рассказываем вам на страницах нашего сайта.\n\nС тех пор как люди узнали, что звезды не прикреплены к небесной тверди, а на самом деле являются светом далеких светил, и что за ними находятся необъятные просторы космоса, жажда открытий заиграла с удвоенной силой. До конца не открыв и не исследовав Землю, мы тянемся к далеким экзопланетам и двойникам Солнца, странным квазарам и еще более странным черным дырам. Неутомимый ум человека пытается решить все загадки космоса и вместе с их решением сталкивается с еще большим числом загадок и вопросов, которые еще ждут своего часа. Но мы верим, что однажды все загадки космоса будут решены. Хотя это вряд ли. Или нет?"
    ),
    NewsTheme(
        "tesla",
        "Tesla",
        "tesla.webp",
        "Tesla Motors — компания, производящая электромобили и их комплектующие. Основана предпринимателем Илоном Маском, известным своим эксцентричным поведением. Среди последних заявлений Маска — Tesla ценой в 20 тысяч долларов в течение ближайших нескольких лет. Инвесторами компании числятся Ларри Пейдж и Сергей Брин, владельцы корпорации Google. Основная задача компании — сделать электромобили доступными для пользователей среднего ценового сегмента; снизить зависимость от бензиновых двигателей, и следовательно, выхлоп газов.\n\nМодельный ряд Tesla:\n\nTesla Model 3: Самый компактный электромобиль компания Tesla официально презентовала 28 июля 2017 года.\nTesla Model S: пятидверный электромобиль, был впервые показан на Франкфуртском автосалоне в 2009 году\nTesla Model X: Является самым передовым с технической точки зрения, «умным» и безопасным автомобилем класса SUV\nTesla Model Y: Является компактным кроссовером, созданным на платформе Model 3\nTesla Roadster: Самый первый автомобиль калифорнийской компании Tesla Motors, представляет собой спортивный электромобиль\nTesla Cybertruck: Электромобиль-пикап в стиле киберпанк\nTesla Semi: Электрический грузовик (седельный тягач американского типа), разрабатываемый компанией Tesla, презентация которого состоялась 16 ноября 2017 года\nСамый популярный вопрос о линейки Tesla это отличие Model Y от Model 3. Ознакомитесь вы можете в нашем специальном материале."
    ),
    NewsTheme(
        "mars",
        "Планета Марс",
        "mars.webp",
        "Марс — это четвертая по удаленности от Солнца планета нашей Солнечной системы и самая часто упоминаемая в фантастике или просто разговорах между людьми. Именно он является символом переселения на другие планеты.\n\nМ арс расположен от Солнца сразу после Меркурия, Венеры и Земли. Масса Марса составляет всего 10,7% от земной. В данный момент активное исследование Красной планеты ведет Марсоход Кьюриосити, приземлившийся на него в рамках программы NASA летом 2012 года. Учены предполагают, что некогда на Марсе была достаточно плотная атмосфера и, возможно, жизнь. Найденные в последнее время данные косвенно подтверждают эту теорию, но на этом исследование Марса не заканчивается."
    ),
    NewsTheme(
        "nasa",
        "Аэрокосмическое агентство NASA",
        "nasa.webp",
        "NASA представляет собой ведомство, принадлежащее США, а поскольку является одним из самых прогрессивных космических агентств мира, его разработки, исследования и миссии преследует ажиотаж по всему миру. Не так давно NASA посадило марсоход Кьюриосити на поверхность Марса, а к 2030 году именно NASA планирует запуск первой пилотируемой человеком миссии на Красную планету. Американское космическое агентство обладает самым большим бюджетом среди всех аналогичных ведомств мира: за пятьдесят лет NASA истратило около 810,5 миллиардов долларов на космические программы."
    ),
    NewsTheme(
        "elon-musk",
        "Илон Маск",
        "ilon_musk.webp",
        "Илон Маск — предприниматель, с которого был списан образ «Железного человека» (и это не шутка). На счету достаточно молодого и амбициозного Маска ряд интернет-проектов и самые, пожалуй, громкие физические проекты: SpaceX, Tesla и Hyperloop. Про него говорят разное, но достоверно известно, что он хочет вывести человечество в космос, открыв эпоху космического туризма; основать первые колонии на Марсе; свести на нет грязную автомобильную промышленность, предложив качественные электромобили и доставлять людей от Лос-Анджелеса до Сан-Франциско за 30 минут на скорости 1500 км/ч. И сегодня его идеи начинают претворяться в жизнь. 31 мая компания SpaceX вывела на орбиту с помощью ракетоносителя Falcon 9 корабль Crew Dragon, который успешно пристыковался к МКС с двумя астронавтами на борту."
    ),
    NewsTheme(
        "vselennaya",
        "Вселенная",
        "universe.webp",
        "Глядя на нашу Вселенную сегодня, очень легко прийти в восторг от увиденного. Звезды на нашем ночном небе — лишь малая часть, несколько тысячи из сотен миллиардов от того, что присутствует в нашем Млечном Пути.\n\nСам Млечный Путь — лишь одна-одинешенька галактика из триллионов присутствующих, в наблюдаемой Вселенной, которая простирается во всех направлениях примерно на 46 миллиардов световых лет. И все это началось около 13,8 миллиарда лет назад из горячего, плотного, быстрого, расширяющегося состояния, известного как Большой Взрыв.\n\nИменно начиная с Большого Взрыва мы получаем возможность описать нашу Вселенную как полную материи и излучения и подключить известные законы физики, объясняющие современную форму космоса. Но Вселенная продолжает расширяться. Появляются новые звезды, космос эволюционирует."
    ),
    NewsTheme(
        "robototexnika",
        "Робототехника",
        "roboto_tech.webp",
        "Роботы — часть стремительно надвигающегося будущего высоких технологий. В настоящее время на планете Земля в сфере робототехники революции происходят чуть ли не каждую неделю. Роботы спасают людей, работают в экстремальных условиях, заменяют живое общение, исследуют планеты Солнечной системы и многое другое. От слуг до наставников, роботы развиваются чрезвычайно быстрыми темпами. Работа в сфере робототехники на данный момент борется с самой важной задачей: как оснастить робота искусственным интеллектом. Говорят, именно с этой целью известный футуролог Рэй Курцвейл пришел работать в Google."
    ),
    NewsTheme(
        "spacex",
        "Компания SpaceX",
        "spacex.webp",
        "SpaceX — первая в мире частная компания, разрабатывающая ракеты для космических пассажирских перевозок. Основана Илоном Маском, имеющим непосредственное отношение также к PayPal и Tesla. По всеобщему признанию является самой прогрессивной компанией по разработке космических кораблей (за исключением, пожалуй, спецподразделений NASA и DARPA). Тот факт, что NASA заключила договор на доставку астронавтов к МКС с SpaceX, Boeing и другими партнерами, говорит о том, что SpaceX уже смогла громко заявить о себе. 30-31 мая 2020 года компания успешно запустила корабль Crew Dragon к МКС."
    ),
    NewsTheme(
        "zdorove",
        "Здоровье человека",
        "healthy.webp",
        "Здоровье человека — высшая ценность. Единственное, что может поправить здоровье больного человека — это медицина. Но медицина целиком и полностью зависит от уровня развития технологий, поскольку с таким тонким и хрупким материалом, как организм человека, приходится работать лишь самыми совершенными инструментами.\n\nЛазерная хирургия глаза, магнитно-резонансная томография, импланты и высокотехнологичные протезы — все это было бы невозможно без вмешательства технологий в медицину. Зато теперь мы задали вектор и технологии развиваются все стремительнее. Даже сложно представить, что будет лет через двадцать. Поживем — увидим. А пока расскажем об этом."
    ),
    NewsTheme(
        "future",
        "Будущее",
        "future.webp",
        "Кто бы мог подумать — не прошло и пятнадцати лет с тех пор, как вышел iPhone, а мир телефонов так кардинально поменялся. И кто знает, что ждет нас в следующем десятилетии? Открытия в сфере трансплантации, разработка графеновых транзисторов, космический туризм. Все это будущее, и предсказать его сложно. Хоть и возможно — за это футурологам платят деньги.\n\nМногие думают, что в будущем нас ждет что-то хорошее. Мы тоже остаемся оптимистами, но понимаем, что все может быть иначе. Особенно, учитывая экономические кризисы, военные конфликты и коронавирус, который вызвал на планете пандемию. Все это может закончиться, или начаться с новой силой. Но нам больше интересны технологии. О них мы и рассказываем."
    ),
    NewsTheme(
        "medicina",
        "Медицина",
        "medicina.webp",
        "Со времен Парацельса и других алхимиков наука вывела медицину на принципиально новый уровень. Мы уже рассказывали, что его достаточно для того, чтобы мы могли перестать болеть многими болезнями и сохранили миллионы жизней. Теперь мы готовы рассказать о том, какие новые открытия ученые продолжают делать.\n\nВ странах, где медицина развивается в соответствии с развитием технологий, дела у больных идут очень хорошо. Высокие технологии непосредственно включаются в процесс лечения людей, наблюдения за ними, и в них вкладываются огромные деньги. Конечно же, это благоприятно сказывается на секторе здравоохранения в целом в любой стране мира. Медицинское оборудование дорогого стоит, но с течением времени становится все более доступным и популярным даже среди самых консервативных. Результаты говорят сами за себя."
    ),
    NewsTheme(
        "iskusstvennyj-intellekt",
        "Искуственный интеллект",
        "art_intel.webp",
        "Люди хороши во многом: многие из нас заражены жаждой первооткрытий, умеют играть в шахматы и решать сложные политические вопросы. Однако некоторые вопросы мы все же оставляем на откуп компьютеров. Мы отдаем им почти все, что не хотим делать сами.\n\nДаже больше: практически все механические расчеты выполняют компьютеры. Но у них нет души, сознания и свободы воли. Именно над этим решением — над тем, как компьютеру пройти тест Тьюринга, — и работают ученые в сфере искусственного интеллекта. Искусственный интеллект, учитывая огромные возможности электронных вычислительных машин, мог бы справляться с рядом важнейших задач, а также решать сложные вопросы глобального порядка, от мира во всем мире до колонизации далеких галактик."
    ),
    NewsTheme(
        "rossiya",
        "Российские технологии",
        "universe.webp",
        "Со времен Парацельса и других алхимиков наука вывела медицину на принципиально новый уровень. Мы уже рассказывали, что его достаточно для того, чтобы мы могли перестать болеть многими болезнями и сохранили миллионы жизней. Теперь мы готовы рассказать о том, какие новые открытия ученые продолжают делать.\n\nВ странах, где медицина развивается в соответствии с развитием технологий, дела у больных идут очень хорошо. Высокие технологии непосредственно включаются в процесс лечения людей, наблюдения за ними, и в них вкладываются огромные деньги. Конечно же, это благоприятно сказывается на секторе здравоохранения в целом в любой стране мира. Медицинское оборудование дорогого стоит, но с течением времени становится все более доступным и популярным даже среди самых консервативных. Результаты говорят сами за себя."
    ),
    NewsTheme(
        "kosmos",
        "Космос",
        "",
        ""
    ),
    NewsTheme(
        "issledovaniya",
        "Научные исследования",
        "",
        ""
    ),
    NewsTheme(
        "samsung",
        "Технологии Samsung",
        "",
        ""
    ),
    NewsTheme(
        "video",
        "Видео про технологии",
        "",
        ""
    ),
    NewsTheme(
        "usa",
        "США в науке",
        "",
        ""
    ),
    NewsTheme(
        "chelovek",
        "Человек в науке",
        "",
        ""
    ),
    NewsTheme(
        "zemlya",
        "Планета Земля",
        "",
        ""
    ),
    NewsTheme(
        "zhivotnye",
        "Животные Земли",
        "",
        ""
    ),
    NewsTheme(
        "kosmicheskie-missii",
        "Космические миссии",
        "",
        ""
    ),
    NewsTheme(
        "google",
        "Технологии Google",
        "",
        ""
    ),
    NewsTheme(
        "kitaj",
        "Научные достижения Китая",
        "",
        ""
    ),
    NewsTheme(
        "apple",
        "Компания Apple",
        "",
        ""
    ),
    NewsTheme(
        "eksperimenty",
        "Научные эксперименты",
        "",
        ""
    ),
    NewsTheme(
        "fizika",
        "Наука физика",
        "",
        ""
    ),
    NewsTheme(
        "istoriya",
        "История технологий",
        "",
        ""
    ),
    NewsTheme(
        "dopolnennaya-virtualnaya-realnost",
        "Дополненная и виртуальная реальность",
        "",
        ""
    ),
    NewsTheme(
        "biologiya",
        "Биология",
        "",
        ""
    ),
    NewsTheme(
        "vselennaya",
        "Вселенная",
        "",
        ""
    ),
    NewsTheme(
        "videocards",
        "Видеокарты для игр и майнинга",
        "",
        ""
    ),
    NewsTheme(
        "sony",
        "Технологии Sony",
        "",
        ""
    ),
    NewsTheme(
        "solnechnaya-sistema",
        "Солнечная система",
        "",
        ""
    ),
    NewsTheme(
        "muzyka",
        "Музыка в науке",
        "",
        ""
    ),
    NewsTheme(
        "luna",
        "Луна",
        "",
        ""
    ),
    NewsTheme(
        "spacex",
        "Компания SpaceX",
        "",
        ""
    ),
    NewsTheme(
        "transport",
        "Транспортные средства",
        "",
        ""
    ),
    NewsTheme(
        "elektromobili",
        "Электромобили",
        "",
        ""
    ),
    NewsTheme(
        "obzory-zheleza",
        "Обзор современных устройств",
        "",
        ""
    ),
    NewsTheme(
        "avtomobili",
        "Автомобили будущего",
        "",
        ""
    ),
    NewsTheme(
        "bolezni",
        "Болезни человека",
        "",
        ""
    ),
    NewsTheme(
        "otkrytiya",
        "Научные открытия",
        "",
        ""
    ),
    NewsTheme(
        "naushniki",
        "Hi End наушники",
        "",
        ""
    ),
    NewsTheme(
        "yaponiya",
        "Японские технологии",
        "",
        ""
    ),
    NewsTheme(
        "elon-mask",
        "Элон Маск",
        "",
        ""
    ),
    NewsTheme(
        "3d-pechat",
        "3D-печать",
        "",
        ""
    ),
    NewsTheme(
        "mozg",
        "Мозг человека",
        "",
        ""
    ),
    NewsTheme(
        "vnezemnaya-zhizn",
        "Внеземная жизнь",
        "",
        ""
    ),
    NewsTheme(
        "astronomiya",
        "Астрономия",
        "",
        ""
    ),
    NewsTheme(
        "nosimaya-elektronika",
        "Носимая электроника",
        "",
        ""
    ),
    NewsTheme(
        "samolety",
        "Самолеты",
        "",
        ""
    ),
    NewsTheme(
        "lechenie",
        "Технологии для лечения",
        "",
        ""
    ),
    NewsTheme(
        "media",
        "MP3 плееры",
        "",
        ""
    ),
    NewsTheme(
        "playstation-4",
        "PlayStation 4",
        "",
        ""
    ),
    NewsTheme(
        "android",
        "Операционная система Android",
        "",
        ""
    ),
    NewsTheme(
        "planety",
        "Планеты",
        "",
        ""
    ),
    NewsTheme(
        "food",
        "Еда",
        "",
        ""
    ),
    NewsTheme(
        "sputniki",
        "Искусственные спутники Земли",
        "",
        ""
    ),
    NewsTheme(
        "zvuk",
        "Звук",
        "",
        ""
    ),
    NewsTheme(
        "zhizn",
        "Жизнь на Земле",
        "",
        ""
    ),
    NewsTheme(
        "texnologii-budushhego",
        "Технологии будущего",
        "",
        ""
    ),
    NewsTheme(
        "voennye-texnologii",
        "Военные технологии",
        "",
        ""
    ),
    NewsTheme(
        "osvoenie-kosmosa",
        "Освоение космоса",
        "",
        ""
    ),
    NewsTheme(
        "zvezdy",
        "Звезды",
        "",
        ""
    ),
    NewsTheme(
        "ekologiya",
        "Экология",
        "",
        ""
    ),
    NewsTheme(
        "psixologiya",
        "Психологические исследования",
        "",
        ""
    ),
    NewsTheme(
        "ekzoplanety",
        "Экзопланеты",
        "",
        ""
    ),
    NewsTheme(
        "zagadki-prirody",
        "Загадки природы",
        "",
        ""
    ),
    NewsTheme(
        "elon-musk",
        "Илон Маск",
        "",
        ""
    ),
    NewsTheme(
        "chelovecheskij-mozg",
        "Человеческий мозг",
        "",
        ""
    ),
    NewsTheme(
        "ces",
        "Выставка CES",
        "",
        ""
    ),
    NewsTheme(
        "izobreteniya",
        "Изобретения",
        "",
        ""
    ),
    NewsTheme(
        "mks",
        "МКС",
        "",
        ""
    ),
    NewsTheme(
        "chassis",
        "Компьютерные корпуса",
        "",
        ""
    ),
    NewsTheme(
        "drony",
        "Дроны",
        "",
        ""
    ),
    NewsTheme(
        "rakety",
        "Ракеты",
        "",
        ""
    ),
    NewsTheme(
        "chernye-dyry",
        "Черные дыры",
        "",
        ""
    ),
    NewsTheme(
        "asteroidy",
        "Астероиды",
        "",
        ""
    ),
    NewsTheme(
        "intel",
        "Технологии Intel",
        "",
        ""
    ),
    NewsTheme(
        "filmy",
        "Научные фильмы",
        "",
        ""
    ),
    NewsTheme(
        "kompyuternye-igry",
        "Компьютерные игры",
        "",
        ""
    ),
    NewsTheme(
        "koronavirus",
        "Коронавирус",
        "",
        ""
    ),
    NewsTheme(
        "organy",
        "Органы человека",
        "",
        ""
    ),
    NewsTheme(
        "galaktiki",
        "Галактики",
        "",
        ""
    ),
    NewsTheme(
        "materialy",
        "Научные материалы",
        "",
        ""
    ),
    NewsTheme(
        "internet",
        "Интернет будущего",
        "",
        ""
    ),
    NewsTheme(
        "chelovechestvo",
        "Человечество",
        "",
        ""
    ),
    NewsTheme(
        "bakterii",
        "Бактерии",
        "",
        ""
    ),
    NewsTheme(
        "xbox-one",
        "Xbox One",
        "",
        ""
    ),
    NewsTheme(
        "virusy",
        "Вирусы",
        "",
        ""
    ),
    NewsTheme(
        "okruzhayushhaya-sreda",
        "Окружающая среда",
        "",
        ""
    ),
    NewsTheme(
        "priroda",
        "Природа Земли",
        "",
        ""
    ),
    NewsTheme(
        "solnce",
        "Солнце",
        "",
        ""
    ),
    NewsTheme(
        "rak",
        "Раковые заболевания",
        "",
        ""
    ),
    NewsTheme(
        "inoplanetyane",
        "Инопланетяне",
        "",
        ""
    ),
    NewsTheme(
        "bespilotniki",
        "Беспилотники",
        "",
        ""
    ),
    NewsTheme(
        "igrovaya-industriya",
        "Игровые технологии",
        "",
        ""
    ),
    NewsTheme(
        "solnechnaya-energiya",
        "Солнечная энергия",
        "",
        ""
    ),
    NewsTheme(
        "bespilotnye-drony",
        "Дроны",
        "",
        ""
    ),
    NewsTheme(
        "kriptovalyuta",
        "Криптовалюта",
        "",
        ""
    ),
    NewsTheme(
        "arxeologiya",
        "Археология",
        "",
        ""
    ),
    NewsTheme(
        "roskosmos",
        "Корпорация Роскосмос",
        "",
        ""
    ),
    NewsTheme(
        "kosmicheskie-polety",
        "Космические полеты",
        "",
        ""
    ),
    NewsTheme(
        "samoupravlyaemye-avtomobili",
        "Самоуправляемые автомобили",
        "",
        ""
    ),
    NewsTheme(
        "rasteniya",
        "Виды растений",
        "",
        ""
    ),
    NewsTheme(
        "weapon",
        "Оружие будущего",
        "",
        ""
    ),
    NewsTheme(
        "lyudi",
        "Люди Земли",
        "",
        ""
    ),
    NewsTheme(
        "katastrofy",
        "Катастрофы Земли",
        "",
        ""
    ),
    NewsTheme(
        "genetika",
        "Генетика",
        "",
        ""
    ),
    NewsTheme(
        "energiya",
        "Энергия",
        "",
        ""
    ),
    NewsTheme(
        "3d-printery",
        "3D-принтеры",
        "",
        ""
    ),
    NewsTheme(
        "bespilotnyj-avtomobil",
        "Беспилотные автомобили",
        "",
        ""
    ),
    NewsTheme(
        "nintendo",
        "Игры Nintendo",
        "",
        ""
    ),
    NewsTheme(
        "teleskopy",
        "Телескопы",
        "",
        ""
    ),
    NewsTheme(
        "mit",
        "Технологический институт MIT",
        "",
        ""
    ),
    NewsTheme(
        "nanotexnologii",
        "Нанотехнологии",
        "",
        ""
    ),
    NewsTheme(
        "oculus-rift",
        "Шлем VR Oculus Rift",
        "",
        ""
    ),
    NewsTheme(
        "elektrichestvo",
        "Электричество",
        "",
        ""
    ),
    NewsTheme(
        "klimat",
        "Климат на Земле",
        "",
        ""
    ),
    NewsTheme(
        "lekarstva",
        "Лекарства от болезней",
        "",
        ""
    ),
    NewsTheme(
        "globalnoe-poteplenie",
        "Глобальное потепление",
        "",
        ""
    ),
    NewsTheme(
        "okean",
        "Океан",
        "",
        ""
    ),
    NewsTheme(
        "temnaya-materiya",
        "Темная материя",
        "",
        ""
    ),
    NewsTheme(
        "batarei",
        "Электрические батареи",
        "",
        ""
    ),
    NewsTheme(
        "majning",
        "Майнинг",
        "",
        ""
    ),
    NewsTheme(
        "google-glass",
        "Очки Google Glass",
        "",
        ""
    ),
    NewsTheme(
        "dalnij-kosmos",
        "Дальний космос",
        "",
        ""
    ),
    NewsTheme(
        "alternativnaya-energiya",
        "Альтернативная энергия",
        "",
        ""
    ),
    NewsTheme(
        "sport",
        "Технологии в спорте",
        "",
        ""
    ),
    NewsTheme(
        "kvantovaya-mexanika",
        "Квантовая механика",
        "",
        ""
    ),
    NewsTheme(
        "paleontologiya",
        "Палеонтология",
        "",
        ""
    ),
    NewsTheme(
        "facebook",
        "Технологии Facebook",
        "",
        ""
    ),
    NewsTheme(
        "dnk",
        "ДНК",
        "",
        ""
    ),
    NewsTheme(
        "dinozavry",
        "Динозавры",
        "",
        ""
    ),
    NewsTheme(
        "young_science",
        "Молодежь и наука",
        "",
        ""
    ),
    NewsTheme(
        "mlechnyj-put",
        "Млечный Путь",
        "",
        ""
    ),
    NewsTheme(
        "lazery",
        "Лазеры",
        "",
        ""
    ),
    NewsTheme(
        "windows",
        "Microsoft Windows",
        "",
        ""
    ),
    NewsTheme(
        "nasekomye",
        "Насекомые Земли",
        "",
        ""
    ),
    NewsTheme(
        "kosmicheskie-teleskopy",
        "Космические телескопы",
        "",
        ""
    ),
    NewsTheme(
        "mobilnye-prilozheniya",
        "Мобильные приложения",
        "",
        ""
    ),
    NewsTheme(
        "amd",
        "Технологии AMD",
        "",
        ""
    ),
    NewsTheme(
        "kosmicheskie-kolonii",
        "Космические колонии",
        "",
        ""
    ),
    NewsTheme(
        "vysokie-texnologii",
        "Высокие технологии",
        "",
        ""
    ),
    NewsTheme(
        "nvidia",
        "Видеокарты NVIDIA",
        "",
        ""
    ),
    NewsTheme(
        "stroitelstvo",
        "Строительные технологии",
        "",
        ""
    ),
    NewsTheme(
        "evolyuciya",
        "Эволюция человека",
        "",
        ""
    ),
    NewsTheme(
        "study",
        "Обучение наукам",
        "",
        ""
    ),
    NewsTheme(
        "superkompyutery",
        "Суперкомпьютеры",
        "",
        ""
    ),
    NewsTheme(
        "grafen",
        "Графен",
        "",
        ""
    ),
    NewsTheme(
        "darpa",
        "Военное агентство DARPA",
        "",
        ""
    ),
    NewsTheme(
        "rekordy",
        "Установленные рекорды",
        "",
        ""
    ),
    NewsTheme(
        "meteority",
        "Метеориты",
        "",
        ""
    ),
    NewsTheme(
        "zhizn-na-marse",
        "Жизнь на Марсе",
        "",
        ""
    ),
    NewsTheme(
        "svet",
        "Фотоны света",
        "",
        ""
    ),
    NewsTheme(
        "iskusstvo",
        "Научное искусство",
        "",
        ""
    ),
    NewsTheme(
        "pandemiya",
        "Пандемия",
        "",
        ""
    ),
    NewsTheme(
        "windows-10",
        "Windows 10",
        "",
        ""
    ),
    NewsTheme(
        "windows-8",
        "Windows 8",
        "",
        ""
    ),
    NewsTheme(
        "gennaya-inzheneriya",
        "Генная инженерия",
        "",
        ""
    ),
    NewsTheme(
        "kvadrokoptery",
        "Квадрокоптеры",
        "",
        ""
    ),
    NewsTheme(
        "koncepty",
        "Технологические концепты",
        "",
        ""
    ),
    NewsTheme(
        "chasy",
        "Элементарные частицы",
        "",
        ""
    ),
    NewsTheme(
        "yupiter",
        "Планета Юпитер",
        "",
        ""
    ),
    NewsTheme(
        "komety",
        "Кометы",
        "",
        ""
    ),
    NewsTheme(
        "son",
        "Сон",
        "",
        ""
    ),
    NewsTheme(
        "starenie",
        "Старение человека",
        "",
        ""
    ),
    NewsTheme(
        "bolshoj-adronnyj-kollajder",
        "Большой адронный коллайдер",
        "",
        ""
    ),
    NewsTheme(
        "geny",
        "Гены",
        "",
        ""
    ),
    NewsTheme(
        "marsoxod",
        "Марсоход",
        "",
        ""
    ),
    NewsTheme(
        "kosmonavty",
        "Космонавты",
        "",
        ""
    ),
    NewsTheme(
        "mezhdunarodnaya-kosmicheskaya-stanciya",
        "Международная космическая станция",
        "",
        ""
    ),
    NewsTheme(
        "hyperloop",
        "Капсула Hyperloop",
        "",
        ""
    ),
    NewsTheme(
        "kvantovye-kompyutery",
        "Квантовые компьютеры",
        "",
        ""
    ),
    NewsTheme(
        "zrenie",
        "Зрение человека",
        "",
        ""
    ),
    NewsTheme(
        "kvantovaya-fizika",
        "Квантовая физика",
        "",
        ""
    ),
    NewsTheme(
        "ibm",
        "Технологии IBM",
        "",
        ""
    ),
    NewsTheme(
        "novye-gorizonty",
        "Космический аппарат Новые горизонты",
        "",
        ""
    ),
    NewsTheme(
        "pamyat",
        "Память человека",
        "",
        ""
    ),
    NewsTheme(
        "nejrobiologiya",
        "Нейробиология",
        "",
        ""
    ),
    NewsTheme(
        "konferencii",
        "Научные конференции",
        "",
        ""
    ),
    NewsTheme(
        "gibkie-displei",
        "Гибкие дисплеи",
        "",
        ""
    ),
    NewsTheme(
        "umnyj-dom",
        "Умный дом",
        "",
        ""
    ),
    NewsTheme(
        "pitanie",
        "Питание будущего",
        "",
        ""
    ),
    NewsTheme(
        "fakty",
        "Научные факты",
        "",
        ""
    ),
    NewsTheme(
        "pluton",
        "Планета Плутон",
        "",
        ""
    ),
    NewsTheme(
        "teorii",
        "Научные теории",
        "",
        ""
    ),
    NewsTheme(
        "korabli",
        "Водоплавающие корабли",
        "",
        ""
    ),
    NewsTheme(
        "blokchejn",
        "Блокчейн",
        "",
        ""
    ),
    NewsTheme(
        "machine-learning",
        "Машинное обучение",
        "",
        ""
    ),
    NewsTheme(
        "kosmicheskij-turizm",
        "Космический туризм",
        "",
        ""
    ),
    NewsTheme(
        "prirodnye-yavleniya",
        "Природные явления",
        "",
        ""
    ),
    NewsTheme(
        "dron",
        "Дрон",
        "",
        ""
    ),
    NewsTheme(
        "kletki",
        "Клетки человека",
        "",
        ""
    ),
    NewsTheme(
        "saturn",
        "Планета Сатурн",
        "",
        ""
    ),
    NewsTheme(
        "yuzhnaya-koreya",
        "Южная Корея",
        "",
        ""
    ),
    NewsTheme(
        "boeing",
        "Летательные аппараты Boeing",
        "",
        ""
    ),
    NewsTheme(
        "transplantaciya",
        "Трансплантология",
        "",
        ""
    ),
    NewsTheme(
        "innovacii",
        "Инновационные открытия",
        "",
        ""
    ),
    NewsTheme(
        "letatelnye-apparaty",
        "Летательные аппараты",
        "",
        ""
    ),
    NewsTheme(
        "falcon-9",
        "Ракета Falcon 9",
        "",
        ""
    ),
    NewsTheme(
        "zdaniya-i-arxitektura",
        "Здания и архитектура",
        "",
        ""
    ),
    NewsTheme(
        "crispr",
        "Изменение генома CRISPR",
        "",
        ""
    ),
    NewsTheme(
        "gravitaciya",
        "Гравитация",
        "",
        ""
    ),
    NewsTheme(
        "alkogol",
        "Алкоголь",
        "",
        ""
    ),
    NewsTheme(
        "qualcomm",
        "Технологии Qualcomm",
        "",
        ""
    ),
    NewsTheme(
        "zondy",
        "Космические зонды",
        "",
        ""
    ),
    NewsTheme(
        "yadernaya-energiya",
        "Ядерная энергия",
        "",
        ""
    ),
    NewsTheme(
        "serdce",
        "Сердце человека",
        "",
        ""
    ),
    NewsTheme(
        "stvolovye-kletki",
        "Стволовые клетки",
        "",
        ""
    ),
    NewsTheme(
        "genom",
        "Геном",
        "",
        ""
    ),
    NewsTheme(
        "gravitacionnye-volny",
        "Гравитационные волны",
        "",
        ""
    ),
    NewsTheme(
        "umnye-avtomobili",
        "Умные автомобили",
        "",
        ""
    ),
    NewsTheme(
        "bioinzheneriya",
        "Биоинженерия",
        "",
        ""
    ),
    NewsTheme(
        "arxitektura",
        "Архитектура",
        "",
        ""
    ),
    NewsTheme(
        "massachusetskij-texnologicheskij-institut",
        "Массачусетский технологический институт",
        "",
        ""
    ),
    NewsTheme(
        "ekzoskelety",
        "Экзоскелеты",
        "",
        ""
    ),
    NewsTheme(
        "prognozy",
        "Научные прогнозы",
        "",
        ""
    ),
    NewsTheme(
        "stiven-xoking",
        "Стивен Хокинг",
        "",
        ""
    ),
    NewsTheme(
        "zvezdnye-vojny",
        "Звездные войны",
        "",
        ""
    ),
    NewsTheme(
        "solnechnye-batarei",
        "Солнечные батареи",
        "",
        ""
    ),
    NewsTheme(
        "fantastika",
        "Фантастика",
        "",
        ""
    ),
    NewsTheme(
        "bolshoj-vzryv",
        "Большой взрыв",
        "",
        ""
    ),
    NewsTheme(
        "smert",
        "Биологическая и клиническая смерть",
        "",
        ""
    ),
    NewsTheme(
        "dvigateli",
        "Современные двигатели",
        "",
        ""
    ),
    NewsTheme(
        "boston-dynamics",
        "Роботы Boston Dynamics",
        "",
        ""
    ),
    NewsTheme(
        "astrofizika",
        "Астрофизика",
        "",
        ""
    ),
    NewsTheme(
        "implantaty",
        "Имплантаты",
        "",
        ""
    ),
    NewsTheme(
        "ispytanie",
        "Научные испытания",
        "",
        ""
    ),
    NewsTheme(
        "plastik",
        "Пластик",
        "",
        ""
    ),
    NewsTheme(
        "venera",
        "Планета Венера",
        "",
        ""
    ),
    NewsTheme(
        "xirurgiya",
        "Хирургия",
        "",
        ""
    ),
    NewsTheme(
        "vremya",
        "Время на Земле",
        "",
        ""
    ),
    NewsTheme(
        "kompyuternaya-bezopasnost",
        "Компьютерная безопасность",
        "",
        ""
    ),
    NewsTheme(
        "mikroby",
        "Микробы человека",
        "",
        ""
    ),
    NewsTheme(
        "avtonomnye-avtomobili",
        "Автономные автомобили",
        "",
        ""
    ),
    NewsTheme(
        "orbita",
        "Космическая орбита",
        "",
        ""
    ),
    NewsTheme(
        "internet-veshhej",
        "Интернет вещей",
        "",
        ""
    ),
    NewsTheme(
        "virgin-galactic",
        "Virgin Galactic",
        "",
        ""
    ),
    NewsTheme(
        "diagnostika",
        "Научная диагностика",
        "",
        ""
    ),
    NewsTheme(
        "antarktida",
        "Континент Антарктида",
        "",
        ""
    ),
    NewsTheme(
        "tesla-model-s",
        "Tesla Model S",
        "",
        ""
    ),
    NewsTheme(
        "letayushhie-avtomobili",
        "Летающие автомобили",
        "",
        ""
    ),
    NewsTheme(
        "albert-ejnshtejn",
        "Альберт Эйнштейн",
        "",
        ""
    ),
    NewsTheme(
        "protezy",
        "Протезы будущего",
        "",
        ""
    ),
    NewsTheme(
        "vakcinaciya",
        "Вакцинация от вируса",
        "",
        ""
    ),
    NewsTheme(
        "vozdux",
        "Воздух на Земле",
        "",
        ""
    ),
    NewsTheme(
        "ryby",
        "Рыбы",
        "",
        ""
    ),
    NewsTheme(
        "blood",
        "Кровь",
        "",
        ""
    ),
    NewsTheme(
        "raspoznavanie-lic",
        "Технология распознавания лиц",
        "",
        ""
    ),
    NewsTheme(
        "konec-sveta",
        "Конец света",
        "",
        ""
    ),
    NewsTheme(
        "xiaomi",
        "Технологии Xiaomi",
        "",
        ""
    ),
    NewsTheme(
        "obshhaya-teoriya-otnositelnosti",
        "Общая теория относительности",
        "",
        ""
    ),
    NewsTheme(
        "valve",
        "Игровые технологии Valve",
        "",
        ""
    ),
    NewsTheme(
        "polet-na-mars",
        "Полет на Марс",
        "",
        ""
    ),
    NewsTheme(
        "atmosfera",
        "Атмосфера Земли",
        "",
        ""
    ),
    NewsTheme(
        "nejrony",
        "Нейроны",
        "",
        ""
    ),
    NewsTheme(
        "vooruzhenie",
        "Вооружение будущего",
        "",
        ""
    ),
    NewsTheme(
        "toplivo",
        "Топливо",
        "",
        ""
    ),
    NewsTheme(
        "poezda",
        "Поезда будущего",
        "",
        ""
    ),
    NewsTheme(
        "playstation-vr",
        "PlayStation VR",
        "",
        ""
    ),
    NewsTheme(
        "astronavty",
        "Астронавты",
        "",
        ""
    ),
    NewsTheme(
        "tesla-model-3",
        "Tesla Model 3",
        "",
        ""
    ),
    NewsTheme(
        "star-wars",
        "Технологии вселенной Star Wars",
        "",
        ""
    ),
    NewsTheme(
        "termoyadernyj-sintez",
        "Термоядерный синтез",
        "",
        ""
    ),
    NewsTheme(
        "chemistry",
        "Наука химия",
        "",
        ""
    ),
    NewsTheme(
        "dobycha-poleznyx-resursov",
        "Добыча полезных ресурсов",
        "",
        ""
    ),
    NewsTheme(
        "skorost",
        "Скорость",
        "",
        ""
    ),
    NewsTheme(
        "motocikly",
        "Мотоциклы будущего",
        "",
        ""
    ),
    NewsTheme(
        "radiaciya",
        "Радиация",
        "",
        ""
    ),
    NewsTheme(
        "blue-origin",
        "Космическая компания Blue Origin",
        "",
        ""
    ),
    NewsTheme(
        "puteshestviya",
        "Путешествия по Земле",
        "",
        ""
    ),
    NewsTheme(
        "totalnaya-slezhka",
        "Технологии слежения",
        "",
        ""
    ),
    NewsTheme(
        "kvantovaya-zaputannost",
        "Квантовая запутанность",
        "",
        ""
    ),
    NewsTheme(
        "esa",
        "Космическое агентство ESA",
        "",
        ""
    ),
    NewsTheme(
        "gologramma",
        "Голограмма",
        "",
        ""
    ),
    NewsTheme(
        "rosetta",
        "Космический корабль Rosetta",
        "",
        ""
    ),
    NewsTheme(
        "vich",
        "Болезнь ВИЧ",
        "",
        ""
    ),
    NewsTheme(
        "avtopilot",
        "автопилот",
        "",
        ""
    ),
    NewsTheme(
        "neobychnye-veshhi",
        "Необычные вещи",
        "",
        ""
    ),
    NewsTheme(
        "neobychnye-ustrojstva",
        "Необычные устройства",
        "",
        ""
    ),
    NewsTheme(
        "temnaya-energiya",
        "Темная энергия",
        "",
        ""
    ),
    NewsTheme(
        "atomnye-elektrostancii",
        "Атомные электростанции",
        "",
        ""
    ),
    NewsTheme(
        "metally",
        "Химические элементы металлы",
        "",
        ""
    ),
    NewsTheme(
        "nauchnaya-fantastika",
        "Научная фантастика",
        "",
        ""
    ),
    NewsTheme(
        "sverxnovye",
        "Сверхновые звезды",
        "",
        ""
    ),
    NewsTheme(
        "evropejskoe-kosmicheskoe-agentstvo",
        "Европейское космическое агентство",
        "",
        ""
    ),
    NewsTheme(
        "nejroseti",
        "Нейросети",
        "",
        ""
    ),
    NewsTheme(
        "vertolety",
        "Современные вертолеты",
        "",
        ""
    ),
    NewsTheme(
        "standartnaya-model",
        "Стандартная модель физики",
        "",
        ""
    ),
    NewsTheme(
        "metamaterialy",
        "Метаматериалы",
        "",
        ""
    ),
    NewsTheme(
        "klonirovanie",
        "Клонирование человека и животных",
        "",
        ""
    ),
    NewsTheme(
        "britanskie-uchenye",
        "Британские ученые",
        "",
        ""
    ),
    NewsTheme(
        "onkologiya",
        "Онкология",
        "",
        ""
    ),
    NewsTheme(
        "toyota",
        "Технологии Toyota",
        "",
        ""
    ),
    NewsTheme(
        "teoriya-zagovora",
        "Теория заговора",
        "",
        ""
    ),
    NewsTheme(
        "vodorod",
        "Изобретения на водороде",
        "",
        ""
    ),
    NewsTheme(
        "xbox",
        "Xbox",
        "",
        ""
    ),
    NewsTheme(
        "bill-gejts",
        "Билл Гейтс",
        "",
        ""
    ),
    NewsTheme(
        "podvodnye-lodki",
        "Подводные лодки",
        "",
        ""
    ),
    NewsTheme(
        "seti",
        "Поиск инопланетян SETI",
        "",
        ""
    ),
    NewsTheme(
        "lockheed-martin",
        "Военная компания Lockheed Martin",
        "",
        ""
    ),
    NewsTheme(
        "crew-dragon",
        "Космический корабль Crew Dragon",
        "",
        ""
    ),
    NewsTheme(
        "kassini",
        "Космический аппарат Кассини",
        "",
        ""
    ),
    NewsTheme(
        "nejtrino",
        "Нейтрино",
        "",
        ""
    ),
    NewsTheme(
        "bozon-xiggsa",
        "Бозон Хиггса",
        "",
        ""
    ),
    NewsTheme(
        "atomy",
        "Атомы",
        "",
        ""
    ),
    NewsTheme(
        "yadernoe-oruzhie",
        "Ядерное оружие",
        "",
        ""
    ),
    NewsTheme(
        "magnitnoe-pole",
        "Магнитное поле",
        "",
        ""
    ),
    NewsTheme(
        "deepmind",
        "Искусственный интеллект DeepMind",
        "",
        ""
    ),
    NewsTheme(
        "uber",
        "Разработки Uber",
        "",
        ""
    ),
    NewsTheme(
        "vulkany",
        "Вулканы Земли",
        "",
        ""
    ),
    NewsTheme(
        "skandaly",
        "Скандальные открытия",
        "",
        ""
    ),
    NewsTheme(
        "skanirovanie-mozga",
        "Сканирование мозга",
        "",
        ""
    ),
    NewsTheme(
        "nanochasticy",
        "Наночастица",
        "",
        ""
    ),
    NewsTheme(
        "rabota",
        "Научная работа",
        "",
        ""
    ),
    NewsTheme(
        "rostex",
        "Корпорация Ростех",
        "",
        ""
    ),
    NewsTheme(
        "kosmicheskij-musor",
        "Космический мусор",
        "",
        ""
    ),
    NewsTheme(
        "htc-vive",
        "Шлем виртуальной реальности HTC Vive",
        "",
        ""
    ),
    NewsTheme(
        "futurologiya",
        "Наука футурология",
        "",
        ""
    ),
    NewsTheme(
        "algoritmy",
        "Научные алгоритмы",
        "",
        ""
    ),
    NewsTheme(
        "velosiped",
        "Велосипеды будущего",
        "",
        ""
    ),
    NewsTheme(
        "molekuly",
        "Молекула",
        "",
        ""
    ),
    NewsTheme(
        "observatorii",
        "Обсерватории",
        "",
        ""
    ),
    NewsTheme(
        "gibkaya-elektronika",
        "Гибкая электроника",
        "",
        ""
    ),
    NewsTheme(
        "biotoplivo",
        "Биотопливо",
        "",
        ""
    ),
    NewsTheme(
        "starlink",
        "Спутниковый интернет Starlink",
        "",
        ""
    ),
    NewsTheme(
        "paradoksy-fiziki",
        "Парадоксы физики",
        "",
        ""
    ),
    NewsTheme(
        "playstation",
        "Playstation",
        "",
        ""
    ),
    NewsTheme(
        "optika",
        "Оптические технологии",
        "",
        ""
    ),
    NewsTheme(
        "kibernetika",
        "Кибернетика",
        "",
        ""
    ),
    NewsTheme(
        "mify",
        "Научные мифы",
        "",
        ""
    ),
    NewsTheme(
        "filosofiya",
        "Наука философия",
        "",
        ""
    ),
    NewsTheme(
        "puteshestvie-vo-vremeni",
        "Путешествие во времени",
        "",
        ""
    ),
    NewsTheme(
        "bitcoin",
        "Криптовалюта Bitcoin",
        "",
        ""
    ),
    NewsTheme(
        "hololens",
        "Очки Microsoft HoloLens",
        "",
        ""
    ),
    NewsTheme(
        "chasticy",
        "Частицы",
        "",
        ""
    ),
    NewsTheme(
        "lunnaya-baza",
        "Лунная база",
        "",
        ""
    ),
    NewsTheme(
        "vetryanye-elektrostancii",
        "Ветряные электростанции",
        "",
        ""
    ),
    NewsTheme(
        "nobelevskaya-premiya",
        "Нобелевская премия",
        "",
        ""
    ),
    NewsTheme(
        "3d-skanirovanie",
        "3D-сканирование",
        "",
        ""
    ),
    NewsTheme(
        "mashina-vremeni",
        "Машина времени",
        "",
        ""
    ),
    NewsTheme(
        "apokalipsis",
        "Апокалипсис",
        "",
        ""
    ),
    NewsTheme(
        "voyadzher-1",
        "Космический зонд Вояджер-1",
        "",
        ""
    ),
    NewsTheme(
        "majya",
        "Цивилизация майя",
        "",
        ""
    ),
    NewsTheme(
        "orion",
        "Космический аппарат Orion",
        "",
        ""
    ),
    NewsTheme(
        "cerera",
        "Планета Церера",
        "",
        ""
    ),
    NewsTheme(
        "nlo",
        "НЛО",
        "",
        ""
    ),
    NewsTheme(
        "gopro",
        "Камеры GoPro",
        "",
        ""
    ),
    NewsTheme(
        "skorost-sveta",
        "Скорость света",
        "",
        ""
    ),
    NewsTheme(
        "uglerod",
        "Углерод",
        "",
        ""
    ),
    NewsTheme(
        "vms-ssha",
        "Разработки ВМС США",
        "",
        ""
    ),
    NewsTheme(
        "tumannosti",
        "Туманности",
        "",
        ""
    ),
    NewsTheme(
        "boring-company",
        "Компания Boring Company",
        "",
        ""
    ),
    NewsTheme(
        "teleportaciya",
        "Телепортация",
        "",
        ""
    ),
    NewsTheme(
        "reaktivnye-dvigateli",
        "Реактивные двигатели",
        "",
        ""
    ),
    NewsTheme(
        "elektrocikly",
        "Электроциклы",
        "",
        ""
    ),
    NewsTheme(
        "playstation-5",
        "PlayStation 5",
        "",
        ""
    ),
    NewsTheme(
        "insight",
        "Марсианский модуль InSight",
        "",
        ""
    ),
    NewsTheme(
        "geliosfera",
        "Гелиосфера",
        "",
        ""
    ),
    NewsTheme(
        "odnokristalnaya-sistema",
        "Однокристальная система",
        "",
        ""
    ),
    NewsTheme(
        "kofe",
        "Кофе",
        "",
        ""
    ),
    NewsTheme(
        "sssr",
        "Достижения СССР",
        "",
        ""
    ),
    NewsTheme(
        "nato",
        "НАТО",
        "",
        ""
    ),
    NewsTheme(
        "singulyarnost",
        "Сингулярность",
        "",
        ""
    ),
    NewsTheme(
        "asimo",
        "Робот Asimo",
        "",
        ""
    ),
    NewsTheme(
        "shattly",
        "Шаттлы",
        "",
        ""
    ),
    NewsTheme(
        "devyataya-planeta",
        "Девятая планета",
        "",
        ""
    ),
    NewsTheme(
        "sverxprovodniki",
        "Сверхпроводники",
        "",
        ""
    ),
    NewsTheme(
        "skolkovo",
        "Разработки в Сколково",
        "",
        ""
    ),
    NewsTheme(
        "titan",
        "Суперкомпьютер Titan",
        "",
        ""
    ),
    NewsTheme(
        "apu",
        "Ускоренный процессор APU",
        "",
        ""
    ),
    NewsTheme(
        "generator-energii",
        "Генератор энергии",
        "",
        ""
    ),
    NewsTheme(
        "merkurij",
        "Планета Меркурий",
        "",
        ""
    ),
    NewsTheme(
        "universitet-kalifornii",
        "Университет Калифорнии",
        "",
        ""
    ),
    NewsTheme(
        "magnitosfera",
        "Магнитосфера",
        "",
        ""
    ),
    NewsTheme(
        "nikola-tesla",
        "Никола Тесла",
        "",
        ""
    ),
    NewsTheme(
        "nfc",
        "Технология NFC",
        "",
        ""
    ),
    NewsTheme(
        "pererabotka",
        "Переработка",
        "",
        ""
    ),
    NewsTheme(
        "encelad",
        "Спутник Энцелад",
        "",
        ""
    ),
    NewsTheme(
        "fotony",
        "Фотоны",
        "",
        ""
    ),
    NewsTheme(
        "grasshopper",
        "Ракета Grasshopper",
        "",
        ""
    ),
    NewsTheme(
        "watson",
        "Суперкомпьютер IBM Watson",
        "",
        ""
    ),
    NewsTheme(
        "spaceshiptwo",
        "Космический корабль SpaceShipTwo",
        "",
        ""
    ),
    NewsTheme(
        "skafandry",
        "Скафандры",
        "",
        ""
    ),
    NewsTheme(
        "mineraly",
        "Минералы Земли",
        "",
        ""
    ),
    NewsTheme(
        "unikalnye-operacii",
        "Уникальные операции",
        "",
        ""
    ),
    NewsTheme(
        "falcon-heavy",
        "Ракета Falcon Heavy",
        "",
        ""
    ),
    NewsTheme(
        "kyuriositi",
        "Марсоход Кьюриосити",
        "",
        ""
    ),
    NewsTheme(
        "chervotochiny",
        "Червоточины",
        "",
        ""
    ),
    NewsTheme(
        "superzemli",
        "Суперземли",
        "",
        ""
    ),
    NewsTheme(
        "uglerodnye-nanotrubki",
        "Углеродные нанотрубки",
        "",
        ""
    ),
    NewsTheme(
        "nevesomost",
        "Невесомость",
        "",
        ""
    ),
    NewsTheme(
        "rudiment",
        "Рудименты",
        "",
        ""
    ),
    NewsTheme(
        "gibkie-batarei",
        "Гибкие батареи",
        "",
        ""
    ),
    NewsTheme(
        "materiya",
        "Материя",
        "",
        ""
    ),
    NewsTheme(
        "biometricheskaya-zashhita",
        "Биометрическая защита",
        "",
        ""
    ),
    NewsTheme(
        "vyimiranie-dinozavrov",
        "Вымирание динозавров",
        "",
        ""
    ),
    NewsTheme(
        "gumanoidy",
        "Гуманоиды",
        "",
        ""
    ),
    NewsTheme(
        "krotovaya-nora",
        "Кротовая нора",
        "",
        ""
    ),
    NewsTheme(
        "levitaciya",
        "Левитация",
        "",
        ""
    ),
    NewsTheme(
        "titan-2",
        "Спутник Титан",
        "",
        ""
    ),
    NewsTheme(
        "varp-dvigatel",
        "Варп-двигатель",
        "",
        ""
    ),
    NewsTheme(
        "panspermiya",
        "Гипотеза панспермия",
        "",
        ""
    ),
    NewsTheme(
        "ionnye-dvigateli",
        "Ионный двигатель",
        "",
        ""
    ),
    NewsTheme(
        "solnechnoe-zatmenie",
        "Солнечное затмение",
        "",
        ""
    ),
    NewsTheme(
        "dvojnye-zvezdy",
        "Двойные звезды",
        "",
        ""
    ),
    NewsTheme(
        "yadernyj-sintez",
        "Ядерный синтез",
        "",
        ""
    ),
    NewsTheme(
        "lightning",
        "Молнии",
        "",
        ""
    ),
    NewsTheme(
        "kosmicheskij-lift",
        "Космический лифт",
        "",
        ""
    ),
    NewsTheme(
        "uran",
        "Планета Уран",
        "",
        ""
    ),
    NewsTheme(
        "antimateriya",
        "Антиматерия",
        "",
        ""
    ),
    NewsTheme(
        "buran",
        "Космический корабль Буран",
        "",
        ""
    ),
    NewsTheme(
        "avtomo",
        "автомо",
        "",
        ""
    )

  ];

}